[
  {
    "id": 1,
    "name": "Aaron Parnas",
    "score": "35D",
    "strongestBeliefs": "Institutional integrity, accountability for the Trump administration, and Gen-Z civic engagement.",
    "commonThemes": "Legal breakdowns of DOJ filings, January 6th updates, and \"pro-democracy\" messaging.",
    "audienceProfile": "Young Democrats, legal nerds, and \"Resistance\" Twitter/X veterans.",
    "xUrl": "https://x.com/AaronParnas",
    "substackUrl": "https://aaronparnas.substack.com/",
    "youtubeUrl": "https://www.youtube.com/@aaronparnas1",
    "instagramUrl": "https://www.instagram.com/aaronparnas",
    "tiktokUrl": "https://www.tiktok.com/@aaronparnas1?lang=en"
  },
  {
    "id": 2,
    "name": "Ben Shapiro",
    "score": "45R",
    "strongestBeliefs": "Small government, religious traditionalism, and \"facts over feelings\" (rationalist conservatism).",
    "commonThemes": "Cultural critiques of \"wokeness,\" Israeli security, and constitutional originalism.",
    "audienceProfile": "Conservative youth, traditionalist families, and libertarian-leaning Republicans.",
    "xUrl": "https://x.com/benshapiro",
    "youtubeUrl": "https://www.youtube.com/channel/UCnQC_G5Xsjhp9fEJKuIcrSw",
    "instagramUrl": "https://www.instagram.com/officialbenshapiro",
    "tiktokUrl": "https://www.tiktok.com/@real.benshapiro?lang=en"
  },
  {
    "id": 3,
    "name": "Noah Smith",
    "score": "8D",
    "strongestBeliefs": "Industrial policy (\"Abundance Agenda\"), techno-optimism, and liberal democracy.",
    "commonThemes": "Urbanism, Japan's economy, semiconductor manufacturing, and debunking \"doomerism.\"",
    "audienceProfile": "\"Neo-liberals,\" tech founders, policy wonks, and San Francisco/NYC urbanites.",
    "xUrl": "https://x.com/Noahpinion",
    "substackUrl": "https://www.noahpinion.blog/",
    "youtubeUrl": "https://www.youtube.com/@ECON102Podcast"
  },
  {
    "id": 4,
    "name": "Nick Shirley",
    "score": "38R",
    "strongestBeliefs": "Traditional American values, skepticism of progressive social policies.",
    "commonThemes": "Street interviews (\"Man on the street\") highlighting contradictions in liberal cities, immigration, and campus politics.",
    "audienceProfile": "Viral video consumers, right-leaning Gen-Z, and critics of mainstream urban governance."
  },
  {
    "id": 5,
    "name": "Andrew Callaghan",
    "score": "5D",
    "strongestBeliefs": "Gonzo-style empathy; he believes in letting the \"fringe\" speak for themselves without an overt narrator bias.",
    "commonThemes": "Subcultures, political rallies (both sides), and the \"unseen\" America.",
    "audienceProfile": "Hyper-online Gen-Z/Millennials, fans of irony, and people disillusioned with polished news."
  },
  {
    "id": 6,
    "name": "Nate Silver",
    "score": "2D",
    "strongestBeliefs": "Probabilistic thinking and the fallibility of experts.",
    "commonThemes": "Polling errors, election forecasting, and the \"pundit fallacy.\"",
    "audienceProfile": "\"Rationalists,\" gamblers, and political junkies who prefer math over narratives."
  },
  {
    "id": 7,
    "name": "Matthew Yglesias",
    "score": "12D",
    "strongestBeliefs": "\"One Billion Americans\" (pro-growth), pragmatism, and policy \"wonkery.\"",
    "commonThemes": "Housing supply, neoliberal economics, and criticizing the Democratic party for being \"too activist-driven.\"",
    "audienceProfile": "Policy professionals, moderate Democrats, and \"YIMBY\" (Yes In My Backyard) advocates."
  },
  {
    "id": 8,
    "name": "Bari Weiss",
    "score": "15R",
    "strongestBeliefs": "Liberalism (in the classical sense), free speech, and opposition to \"illiberalism\" on the left.",
    "commonThemes": "Cancel culture, anti-Semitism, and the \"capture\" of elite institutions by progressive ideology.",
    "audienceProfile": "Disaffected liberals, \"intellectual dark web\" fans, and centrist conservatives."
  },
  {
    "id": 9,
    "name": "Lee Fang",
    "score": "5D",
    "strongestBeliefs": "Anti-corporatism and government transparency.",
    "commonThemes": "Lobbying scandals, the military-industrial complex, and Pfizer/Big Pharma critiques.",
    "audienceProfile": "Investigative journalism purists, civil libertarians, and skeptics of the \"Deep State\" from both sides."
  },
  {
    "id": 10,
    "name": "Kyla Scanlon",
    "score": "3D",
    "strongestBeliefs": "Financial literacy and the \"Human\" element of the economy.",
    "commonThemes": "The \"Vibecession,\" housing affordability, and breaking down Fed policy for Gen-Z.",
    "audienceProfile": "Young professionals, retail investors, and people who find traditional financial news too dry or biased."
  },
  {
    "id": 11,
    "name": "Chris Cillizza",
    "score": 0,
    "strongestBeliefs": "The importance of political \"mechanics\" and the idea that everything is a campaign. He believes in analyzing the how of politics over the why.",
    "commonThemes": "Horse-race election coverage, the strategy of political messaging, and \"The Point\"—distilling complex news into quick, readable takeaways.",
    "audienceProfile": "Political junkies, DC insiders, and readers who want to understand the \"game\" of politics without a moral lecture."
  },
  {
    "id": 12,
    "name": "Steven Bonnell",
    "score": "5D",
    "strongestBeliefs": "Institutionalism, market-driven liberalism, and rigorous debate. He is a staunch defender of capitalism and US foreign policy while holding progressive social views.",
    "commonThemes": "Long-form debates with extremists on both sides, deconstructing misinformation, and defending \"the establishment\" against populist critiques.",
    "audienceProfile": "High-information Gen-Z/Millennials, \"Omniliberal\" fans, and people who enjoy intellectual combat and long-form Twitch/YouTube streams."
  },
  {
    "id": 13,
    "name": "Tyler Cowen",
    "score": "5R",
    "strongestBeliefs": "State capacity, cultural growth, and \"Stubborn Attachments\" to long-term economic prosperity.",
    "commonThemes": "Market economics, the impact of AI on society, travel/food as a lens for culture, and \"Great Founder Theory.",
    "audienceProfile": "Economists, Silicon Valley founders, venture capitalists, and the \"intellectual curious\" who value data over partisan narratives."
  },
  {
    "id": 14,
    "name": "Judd Legum",
    "score": "45D",
    "strongestBeliefs": "Corporate accountability, voting rights, and anti-disinformation.",
    "commonThemes": "Tracking corporate donations to controversial causes, Florida’s education policies, and labor rights.",
    "audienceProfile": "Activists, corporate watchdog groups, and mainstream Democrats."
  },
  {
    "id": 15,
    "name": "Brian Tyler Cohen",
    "score": "48D",
    "strongestBeliefs": "Democratic party effectiveness and progressive judicial reform.",
    "commonThemes": "Live reactions to GOP hearings, interviews with top Democratic officials (Biden, Harris, Schumer), and voter mobilization.",
    "audienceProfile": "High-engagement Democratic voters and Gen-Z progressives."
  },
  {
    "id": 16,
    "name": "Heather Cox Richardson",
    "score": "30D",
    "strongestBeliefs": "Liberal democracy, historical continuity, and the protection of the Constitution.",
    "commonThemes": "Daily historical context for current news, the history of the Republican vs. Democratic parties, and the preservation of civil rights.",
    "audienceProfile": "Educated Boomers, history buffs, and institutional liberals."
  },
  {
    "id": 17,
    "name": "Hasan Piker",
    "score": "50D",
    "strongestBeliefs": "Democratic socialism, wealth redistribution, and anti-imperialism.",
    "commonThemes": "Commentary on \"gaming\" culture vs. politics, unionization, and critiques of capitalism.",
    "audienceProfile": "Gen-Z/Gen-Alpha, Twitch streamers, and young socialists."
  },
  {
    "id": 18,
    "name": "David Pakman",
    "score": "35D",
    "strongestBeliefs": "Rationality, social democracy, and evidence-based policy.",
    "commonThemes": "Debunking right-wing talking points, economic analysis of middle-class policy, and secularism.",
    "audienceProfile": "Secular progressives, logic-focused liberals, and podcast listeners."
  },
  {
    "id": 19,
    "name": "Aaron Rupar",
    "score": "42D",
    "strongestBeliefs": "Media accountability and anti-Trumpism.",
    "commonThemes": "Clips of Fox News/GOP inconsistencies, breakdowns of political rhetoric, and \"Resistance\" commentary.",
    "audienceProfile": "X-power users, media critics, and anti-Trump conservatives/liberals."
  },
  {
    "id": 20,
    "name": "Robert Reich",
    "score": "45D",
    "strongestBeliefs": "Labor power, curbing corporate monopolies, and tax reform.",
    "commonThemes": "The \"rigged economy,\" CEO-to-worker pay ratios, and the importance of unions.",
    "audienceProfile": "Labor advocates, economics students, and progressive educators."
  },
  {
    "id": 21,
    "name": "Kyle Kulinski",
    "score": "48D",
    "strongestBeliefs": "Populist progressivism and free speech.",
    "commonThemes": "Medicare for All, ending \"forever wars,\" and criticizing the Democratic establishment from the left.",
    "audienceProfile": "Disaffected young liberals and Bernie Sanders supporters."
  },
  {
    "id": 22,
    "name": "Natalie Wynn",
    "score": "40D",
    "strongestBeliefs": "Social justice, trans rights, and philosophical deconstruction of the right.",
    "commonThemes": "Deep-dive video essays on \"The West,\" \"Wokeism,\" and cultural aesthetics.",
    "audienceProfile": "Academics, the LGBTQ+ community, and YouTube video-essay enthusiasts."
  },
  {
    "id": 23,
    "name": "MeidasTouch",
    "score": "46D",
    "strongestBeliefs": "Pro-democracy activism and legal accountability.",
    "commonThemes": "Breaking down Trump’s legal trials, pro-Biden messaging, and \"democracy is on the ballot\" framing.",
    "audienceProfile": "High-energy Democratic activists and anti-MAGA voters."
  },
  {
    "id": 24,
    "name": "Tucker Carlson",
    "score": "48R",
    "strongestBeliefs": "American nationalism, anti-interventionism, and skepticism of \"the ruling class.\"",
    "commonThemes": "The border crisis, critiques of the Ukraine war, and questioning institutional \"narratives\" on health and history.",
    "audienceProfile": "Populist conservatives, rural Americans, and \"New Right\" skeptics."
  },
  {
    "id": 25,
    "name": "Candace Owens",
    "score": "50R",
    "strongestBeliefs": "Traditional family structures, religious morality, and skepticism of modern social movements.",
    "commonThemes": "Critiquing \"Black Lives Matter,\" Hollywood culture, and globalist organizations.",
    "audienceProfile": "Cultural conservatives, \"Blexit\" supporters, and conspiracy-adjacent skeptics."
  },
  {
    "id": 26,
    "name": "Tim Pool",
    "score": "25R",
    "strongestBeliefs": "Free speech, civil liberties, and anti-corporate media.",
    "commonThemes": "The \"collapse\" of cities, media bias, and culture war flashpoints.",
    "audienceProfile": "Disaffected former liberals, libertarians, and \"prep-focused\" Gen-X/Millennials."
  },
  {
    "id": 27,
    "name": "Chris Rufo",
    "score": "45R",
    "strongestBeliefs": "Meritocracy and the dismantling of DEI (Diversity, Equity, and Inclusion) structures.",
    "commonThemes": "Critical Race Theory (CRT) in schools, university reform, and \"recapturing\" institutions.",
    "audienceProfile": "Policy wonks, conservative parents, and intellectual right-wingers."
  },
  {
    "id": 28,
    "name": "Matt Walsh",
    "score": "49R",
    "strongestBeliefs": "Objective truth (specifically on gender), traditional Catholicism, and social conservatism.",
    "commonThemes": "Transgender issues (\"What is a Woman?\"), the \"war on children,\" and anti-woke cultural critiques.",
    "audienceProfile": "Hardline social conservatives and traditionalist Christians."
  },
  {
    "id": 29,
    "name": "Konstantin Kisin",
    "score": "22R",
    "strongestBeliefs": "Western civilization, free speech, and anti-woke humor.",
    "commonThemes": "The \"death of the West,\" immigration in Europe, and mocking progressive \"safe spaces.\"",
    "audienceProfile": "UK/US conservatives, \"Intellectual Dark Web\" fans, and free-speech absolutists."
  },
  {
    "id": 30,
    "name": "Michael Shellenberger",
    "score": "28R",
    "strongestBeliefs": "Nuclear energy, free speech, and urban law and order",
    "commonThemes": "The Twitter Files, \"San Fransicko\" (urban decay), and the \"Censorship Industrial Complex.\"",
    "audienceProfile": "Silicon Valley libertarians, environmental skeptics, and investigative junkies."
  },
  {
    "id": 31,
    "name": "Steven Crowder",
    "score": "47R",
    "strongestBeliefs": "Second Amendment rights, small government, and \"masculine\" values.",
    "commonThemes": "\"Change My Mind\" street segments, mocking liberal protests, and anti-socialism.",
    "audienceProfile": "Young conservative males and \"frat-style\" political fans."
  },
  {
    "id": 32,
    "name": "Erick Erickson",
    "score": "38R",
    "strongestBeliefs": "Religious liberty, federalism, and traditional GOP principles.",
    "commonThemes": "Georgia politics, the intersection of faith and policy, and the future of the Republican party post-Trump.",
    "audienceProfile": "Southern conservatives, church-goers, and establishment-leaning Republicans."
  },
  {
    "id": 33,
    "name": "Mehdi Hasan",
    "score": "48D",
    "strongestBeliefs": "Anti-imperialism, human rights, and aggressive accountability for power.",
    "commonThemes": "Israel-Palestine conflict, deconstructing right-wing rhetoric, and media criticism.",
    "audienceProfile": "Global progressives, activists, and critics of mainstream Western media."
  },
  {
    "id": 34,
    "name": "Matt Taibbi",
    "score": "15R",
    "strongestBeliefs": "Civil liberties, free speech, and skepticism of the \"Censorship Industrial Complex.\"",
    "commonThemes": "The Twitter Files, media malfeasance, and critiques of the Democratic party’s relationship with intelligence agencies.",
    "audienceProfile": "Disaffected liberals, civil libertarians, and \"anti-woke\" skeptics of both parties."
  },
  {
    "id": 35,
    "name": "Joyce Vance",
    "score": "38D",
    "strongestBeliefs": "Rule of law, judicial integrity, and institutional stability.",
    "commonThemes": "Legal analysis of Trump’s indictments, DOJ procedures, and explaining the \"machinery\" of the justice system.",
    "audienceProfile": "\"Legal nerds,\" mainstream Democrats, and followers of MSNBC."
  },
  {
    "id": 36,
    "name": "Dan Rather",
    "score": "32D",
    "strongestBeliefs": "Old-school American patriotism, journalistic integrity, and civil discourse.",
    "commonThemes": "Reflections on historical moments, protecting democracy, and calls for decency in politics.",
    "audienceProfile": "Older liberals, Boomers, and people nostalgic for traditional \"Anchor\" journalism."
  },
  {
    "id": 37,
    "name": "Steve Schmidt",
    "score": "35D",
    "strongestBeliefs": "Defending the Republic against \"autocratic\" threats.",
    "commonThemes": "The threat of MAGA, historical warnings about fascism, and the collapse of the traditional GOP.",
    "audienceProfile": "Never-Trump Republicans, Lincoln Project supporters, and high-engagement Democrats."
  },
  {
    "id": 38,
    "name": "Andrew Sullivan",
    "score": "18R",
    "strongestBeliefs": "Skepticism of extremes, religious freedom, and the \"Great Awokening\" critique.",
    "commonThemes": "Critiquing gender ideology, defending liberal democracy, and the intersection of faith and politics.",
    "audienceProfile": "Intellectual conservatives, \"Old School\" liberals, and people who dislike identity politics."
  },
  {
    "id": 39,
    "name": "Erin Reed",
    "score": "50D",
    "strongestBeliefs": "Transgender rights and healthcare access.",
    "commonThemes": "Tracking legislative \"anti-trans\" bills across the US, gender-affirming care, and LGBTQ+ activism.",
    "audienceProfile": "Trans rights activists, policy researchers, and the LGBTQ+ community."
  },
  {
    "id": 40,
    "name": "Dan Pfeiffer",
    "score": "45D",
    "strongestBeliefs": "Democratic party strategy and digital communication.",
    "commonThemes": "How Democrats can win the \"messaging war,\" breakdowns of GOP tactics, and White House communications.",
    "audienceProfile": "Democratic staffers, \"Pod Save America\" fans, and partisan activists."
  },
  {
    "id": 41,
    "name": "Mary L. Trump",
    "score": "48D",
    "strongestBeliefs": "Psychological accountability and anti-Trumpism.",
    "commonThemes": "The psychology of the Trump family, the danger of a second Trump term, and social justice.",
    "audienceProfile": "Dedicated anti-Trump voters and fans of psychological political analysis."
  },
  {
    "id": 42,
    "name": "Rick Wilson",
    "score": "40D",
    "strongestBeliefs": "Opposing the MAGA movement through aggressive media tactics.",
    "commonThemes": "Mocking GOP leadership, tactical advice for defeating Trump, and the \"Everything Trump Touches Dies\" philosophy.",
    "audienceProfile": "Hardcore anti-MAGA activists and strategy-minded Democrats."
  },
  {
    "id": 43,
    "name": "Seth Abramson",
    "score": "46D",
    "strongestBeliefs": "Investigative \"curation\" and connecting disparate dots of political corruption.",
    "commonThemes": "Foreign interference, \"the insurrection,\" and deep-dive threads on legal corruption.",
    "audienceProfile": "\"Resistance\" Twitter/X base and enthusiasts of complex political investigations."
  },
  {
    "id": 44,
    "name": "Ken Klippenstein",
    "score": "45D",
    "strongestBeliefs": "Government transparency and anti-secrecy.",
    "commonThemes": "FOIA requests, military-industrial complex leaks, and the \"surveillance state.\"",
    "audienceProfile": "Anti-war activists, investigative purists, and skeptics of the CIA/FBI."
  },
  {
    "id": 45,
    "name": "Peter Beinart",
    "score": "42D",
    "strongestBeliefs": "Ethical Jewish identity and a \"one-state\" or \"binational\" solution for Israel-Palestine.",
    "commonThemes": "Critiquing US-Israel policy, the future of American Judaism, and foreign policy ethics.",
    "audienceProfile": "Progressive Jewish Americans, foreign policy academics, and liberal Zionism critics."
  },
  {
    "id": 46,
    "name": "Michael Moore",
    "score": "50D",
    "strongestBeliefs": "Worker power, anti-capitalism, and grassroots activism.",
    "commonThemes": "Wealth inequality, gun control, and mobilizing the \"working class\" against corporate interests.",
    "audienceProfile": "Unions, progressive activists, and long-time fans of his documentary work."
  },
  {
    "id": 47,
    "name": "Glenn Loury",
    "score": "35R",
    "strongestBeliefs": "Meritocracy, racial self-reliance, and intellectual honesty.",
    "commonThemes": "Critiquing the \"racial grievance industry,\" the importance of the nuclear family, and economic data.",
    "audienceProfile": "\"Heterodox\" intellectuals, Black conservatives, and critics of DEI."
  },
  {
    "id": 48,
    "name": "Julie Kelly",
    "score": "48R",
    "strongestBeliefs": "Justice for January 6th defendants and exposing \"deep state\" weaponization.",
    "commonThemes": "January 6th investigations, DOJ \"overreach,\" and defending the MAGA movement from legal challenges.",
    "audienceProfile": "MAGA activists, election skeptics, and hard-right legal observers."
  },
  {
    "id": 49,
    "name": "Richard Hanania",
    "score": "40R",
    "strongestBeliefs": "Scientific rationalism, anti-woke \"civil rights\" reform, and foreign policy realism.",
    "commonThemes": "Why the left wins, the \"woke\" takeover of institutions, and the importance of IQ/merit.",
    "audienceProfile": "Silicon Valley \"Effective Accelerationists,\" New Right intellectuals, and policy wonks."
  },
  {
    "id": 50,
    "name": "Hamilton Nolan",
    "score": "48D",
    "strongestBeliefs": "Labor rights and the destruction of the billionaire class.",
    "commonThemes": "Union organizing, the \"scam\" of corporate capitalism, and radical economic reform.",
    "audienceProfile": "Labor organizers, journalists, and socialist-leaning Millennials."
  },
  {
    "id": 51,
    "name": "Miles Taylor",
    "score": "25D",
    "strongestBeliefs": "National security and \"Anonymous\" dissent against autocracy.",
    "commonThemes": "Safeguarding the executive branch, national security threats, and the \"True North\" project.",
    "audienceProfile": "Moderate Republicans, \"Deep State\" defenders, and centrist Democrats."
  },
  {
    "id": 52,
    "name": "Sasha Stone",
    "score": "35R",
    "strongestBeliefs": "Protecting free speech from \"the mob\" and cultural sanity.",
    "commonThemes": "Her transition from a Hollywood liberal to a critic of the left, the \"Fourth Turning,\" and cultural censorship.",
    "audienceProfile": "Former Democrats, culture-war observers, and critics of \"woke\" Hollywood."
  },
  {
    "id": 53,
    "name": "The Bulwark",
    "score": "12D",
    "strongestBeliefs": "Preserving democratic institutions and opposing \"illiberalism\" on the right.",
    "commonThemes": "The future of the GOP, internal polling of \"swing\" voters, and critiques of the MAGA movement from a conservative lens.",
    "audienceProfile": "Never-Trump Republicans, moderate Democrats, and DC establishment types."
  },
  {
    "id": 54,
    "name": "The Contrarian",
    "score": "38D",
    "strongestBeliefs": "Moral clarity in politics and the \"pro-democracy\" defense of institutions.",
    "commonThemes": "Legal accountability for political figures, the \"authoritarian threat,\" and defending the Biden/Harris legacy.",
    "audienceProfile": "Disaffected center-right voters and mainstream liberals."
  },
  {
    "id": 55,
    "name": "Paul Krugman",
    "score": "44D",
    "strongestBeliefs": "Keynesian economics, the \"social safety net,\" and the danger of supply-side theory.",
    "commonThemes": "Inflation data, debunking \"doomer\" economic takes, and the benefits of government spending.",
    "audienceProfile": "Liberal economists, academics, and readers of The New York Times."
  },
  {
    "id": 56,
    "name": "Sharon McMahon",
    "score": "5D",
    "strongestBeliefs": "Civic education (\"America's Government Teacher\") and non-partisan historical accuracy.",
    "commonThemes": "Civic education (\"America's Government Teacher\") and non-partisan historical accuracy.",
    "audienceProfile": "Educators, parents, and people looking for a detox from partisan screaming."
  },
  {
    "id": 57,
    "name": "Lincoln Square)",
    "score": "45D",
    "strongestBeliefs": "Offensive political warfare against the MAGA movement.",
    "commonThemes": "Campaign-style messaging, psychological operations in media, and aggressive anti-Trump rhetoric.",
    "audienceProfile": "High-intensity anti-MAGA activists and \"The Lincoln Project\" fans."
  },
  {
    "id": 58,
    "name": "Adam Kinzinger",
    "score": "15D",
    "strongestBeliefs": "Integrity, duty, and the preservation of the constitutional order over party loyalty.",
    "commonThemes": "Veterans' issues, foreign policy (Ukraine), and the moral failings of the current GOP.",
    "audienceProfile": "Moderate Republicans and patriotic-leaning Democrats."
  },
  {
    "id": 59,
    "name": "Jerusalem Demsas",
    "score": "10D",
    "strongestBeliefs": "\"Abundance\" liberalism—pro-growth, pro-housing, and pro-technology.",
    "commonThemes": "Zoning reform, industrial policy, and making a positive case for what liberalism can actually build.",
    "audienceProfile": "YIMBYs, Silicon Valley progressives, and policy-oriented \"wonks.\""
  },
  {
    "id": 60,
    "name": "Jay Kuo",
    "score": "42D",
    "strongestBeliefs": "Legal justice and clear communication for the \"resistance.\"",
    "commonThemes": "Breaking down court filings, Supreme Court ethics, and election strategy.",
    "audienceProfile": "Progressive legal observers and highly active Democratic voters."
  },
  {
    "id": 61,
    "name": "Robert Hubbell",
    "score": "36D",
    "strongestBeliefs": "Optimism in the face of political chaos and the power of the individual voter.",
    "commonThemes": "Daily news curation for activists, encouragement to stay engaged, and legislative updates.",
    "audienceProfile": "Grassroots Democratic organizers and \"hopeful\" progressives."
  },
  {
    "id": 62,
    "name": "Dan Pfeiffer",
    "score": "46D",
    "strongestBeliefs": "Strategic communication and reclaiming the \"digital airwaves\" from the right.",
    "commonThemes": "Campaign post-mortems, polling analysis, and advice on how to talk to family about politics.",
    "audienceProfile": "\"Pod Save America\" listeners and Democratic campaign staffers."
  },
  {
    "id": 63,
    "name": "Simon Rosenberg",
    "score": "47D",
    "strongestBeliefs": "Data-driven optimism and the strength of the \"Democratic brand.\"",
    "commonThemes": "Why \"red waves\" don't happen, positive economic data, and the strength of the youth vote.",
    "audienceProfile": "Democratic party cheerleaders and data-minded progressives."
  },
  {
    "id": 64,
    "name": "Jonathan Larsen",
    "score": "40D",
    "strongestBeliefs": "Unvarnished truth-telling without the \"politeness\" of corporate media.",
    "commonThemes": "Daily political summaries, calling out GOP \"absurdity,\" and blunt analysis of the news cycle.",
    "audienceProfile": "Gen-X/Millennial liberals who like \"edgy\" or informal news."
  },
  {
    "id": 65,
    "name": "Jessica Yellin",
    "score": "10D",
    "strongestBeliefs": "Information accessibility and lowering the \"anxiety\" of news consumption.",
    "commonThemes": "Explainer-style reporting, neutral summaries of complex bills, and civic engagement.",
    "audienceProfile": "\"Apolitical\" but curious citizens, busy professionals, and moderate women."
  },
  {
    "id": 66,
    "name": "Anand Giridharadas",
    "score": "48D",
    "strongestBeliefs": "The failure of \"plutocracy\" and the need for radical structural change.",
    "commonThemes": "Critiquing billionaire philanthropy, Davos culture, and the \"persuasion\" of political enemies.",
    "audienceProfile": "Academics, left-leaning intellectuals, and critics of the 1%."
  },
  {
    "id": 67,
    "name": "JoJo Robinson",
    "score": "48D",
    "strongestBeliefs": "Passionate, vocal opposition to the MAGA movement and support for the Biden-Harris agenda.",
    "commonThemes": "Viral political commentary, mocking GOP hypocrisy, and motivating Democratic voters.",
    "audienceProfile": "High-energy digital activists and \"Resistance\" Twitter/X followers."
  },
  {
    "id": 68,
    "name": "Tara Palmeri",
    "score": "5R",
    "strongestBeliefs": "Journalistic \"scoops\" and insider access over ideological commentary.",
    "commonThemes": "DC power dynamics, the inner workings of the Puck/media world, and campaign trail gossip.",
    "audienceProfile": "Media professionals, lobbyists, and political junkies who want \"the room where it happens\" info."
  },
  {
    "id": 69,
    "name": "Derek Thompson",
    "score": "5D",
    "strongestBeliefs": "Techno-optimism, \"Abundance\" (building more housing, energy, and tech), and a belief that media is too focused on catastrophe.",
    "commonThemes": "Work culture, the economics of loneliness, AI, and breaking down complex data into \"Plain English.\"",
    "audienceProfile": "Tech founders, curious professionals, and people looking for a \"hopeful\" take on the future."
  },
  {
    "id": 70,
    "name": "Matt Stoller",
    "score": "10D",
    "strongestBeliefs": "Anti-monopoly and the \"curse of bigness.\" He believes concentrated corporate power is the root of most modern political and economic problems.",
    "commonThemes": "Antitrust litigation (especially against Google and Amazon), the history of monopolies, and trade policy.",
    "audienceProfile": "Lawyers, small business advocates, and \"New Brandis\" economists from both sides of the aisle."
  },
  {
    "id": 71,
    "name": "Andy Borowitz",
    "score": "48D",
    "strongestBeliefs": "Anti-Trumpism and mocking conservative policy through hyperbole.",
    "commonThemes": "Satirical news headlines that highlight the perceived \"absurdity\" of Republican figures.",
    "audienceProfile": "Liberal Gen-Xers and Boomers who enjoy dry, headline-based humor"
  },
  {
    "id": 72,
    "name": "Joyce Vance",
    "score": "38D",
    "strongestBeliefs": "The sanctity of the Department of Justice and the \"Rule of Law\" as a non-partisan pillar.",
    "commonThemes": "Explaining legal indictments, Supreme Court ethics, and the procedural \"how-to\" of federal law.",
    "audienceProfile": "\"Resistance\" legal nerds, MSNBC viewers, and concerned institutionalists."
  },
  {
    "id": 73,
    "name": "Jess Craven",
    "score": "48D",
    "strongestBeliefs": "Civic engagement is the cure for political despair; \"Action is the Antidote.\"",
    "commonThemes": "Daily calls to action (phone banking, letter writing), climate activism, and voting rights.",
    "audienceProfile": "Grassroots organizers, progressive moms, and TikTok-active activists."
  },
  {
    "id": 74,
    "name": "Thom Hartmann",
    "score": "49D",
    "strongestBeliefs": "Social democracy, restoring the \"Middle Class,\" and curbing corporate personhood.",
    "commonThemes": "The history of the FDR-era \"New Deal,\" critiques of Reaganomics, and the importance of labor unions.",
    "audienceProfile": "Progressive radio listeners, union members, and \"New Deal\" nostalgics."
  },
  {
    "id": 75,
    "name": "Charlie Sykes",
    "score": "15D",
    "strongestBeliefs": "Conservative principles (as they were pre-2016), civic decency, and opposition to political \"spin.\"",
    "commonThemes": "The internal rot of the GOP, defending democratic institutions, and cultural critiques of MAGA.",
    "audienceProfile": "Disaffected Republicans, center-left liberals, and \"The Bulwark\" readers."
  },
  {
    "id": 76,
    "name": "Jeff Tiedrich",
    "score": "50D",
    "strongestBeliefs": "Unfiltered, aggressive opposition to Donald Trump and his supporters.",
    "commonThemes": "Snarky commentary on Trump’s social media posts, \"calling out\" GOP hypocrisy with profanity-laced humor.",
    "audienceProfile": "High-intensity anti-Trump X (Twitter) users and progressive \"Reply Guy\" fans."
  },
  {
    "id": 77,
    "name": "Ryan Lizza",
    "score": "5D",
    "strongestBeliefs": "Political journalism as an \"insider\" sport; access and deep-dive reporting.",
    "commonThemes": "The \"Substack-ification\" of media, DC gossip, and long-form analysis of scandals (like his recent Olivia Nuzzi/RFK Jr. series).",
    "audienceProfile": "Beltway insiders, media critics, and fans of long-form \"behind-the-curtain\" reporting."
  },
  {
    "id": 78,
    "name": "Phillip Swicegood",
    "score": "38R",
    "strongestBeliefs": "Traditional conservatism, Southern/Christian values, and the necessity of \"order.\"",
    "commonThemes": "Religious liberty, local Georgia politics, and critiques of progressive social engineering.",
    "audienceProfile": "Red-state conservatives, evangelical Christians, and traditional GOP voters."
  },
  {
    "id": 79,
    "name": "Michael Wolff",
    "score": "20D",
    "strongestBeliefs": "Power is messy, and everyone in politics is motivated by vanity and fear.",
    "commonThemes": "The \"inner life\" of the Trump White House, media industry backstabbing, and the theatrical nature of power.",
    "audienceProfile": "People who love \"gossip-as-news,\" media industry professionals, and fans of Fire and Fury."
  },
  {
    "id": 80,
    "name": "Michael Cohen",
    "score": "50D",
    "strongestBeliefs": "The personal \"evil\" of Donald Trump and the need for legal retribution.",
    "commonThemes": "\"Justice is coming,\" personal anecdotes from his time as Trump's fixer, and interviews with anti-Trump legal experts.",
    "audienceProfile": "Hardcore \"Resistance\" followers and people who enjoy revenge-based political narratives."
  },
  {
    "id": 81,
    "name": "Gabe Fleisher",
    "score": 0,
    "strongestBeliefs": "Informing the public is a civic service; \"politics should be accessible to everyone.\"",
    "commonThemes": "Daily non-partisan news summaries, explaining legislative schedules, and \"civics 101.\"",
    "audienceProfile": "Students, busy professionals, and people who want the news without the \"yelling.\""
  },
  {
    "id": 82,
    "name": "Chris Rufo",
    "score": "45R",
    "strongestBeliefs": "Recapturing institutions from \"radical\" ideologies and restoring meritocracy.",
    "commonThemes": "Critical Race Theory (CRT), DEI in corporations, and university administrative bloat.",
    "audienceProfile": "Intellectual conservatives, \"anti-woke\" parents, and New Right policy makers."
  },
  {
    "id": 83,
    "name": "Sarah Kendzior",
    "score": "45D",
    "strongestBeliefs": "American institutions are inherently fragile and vulnerable to authoritarian capture.",
    "commonThemes": "Transnational crime, the \"Invention of Donald Trump,\" and warnings about the erosion of democratic norms.",
    "audienceProfile": "\"Resistance\" academics, researchers of autocracy, and fans of her Gaslit Nation podcast."
  },
  {
    "id": 84,
    "name": "Wajahat Ali",
    "score": "40D",
    "strongestBeliefs": "Multiracial democracy and the \"joy\" of political resistance through storytelling.",
    "commonThemes": "Reclaiming the American narrative, Pakistani-American identity, and critiques of white supremacy.",
    "audienceProfile": "Diverse progressives, interfaith activists, and readers of The Daily Beast."
  },
  {
    "id": 85,
    "name": "Qasim Rashid",
    "score": "48D",
    "strongestBeliefs": "Universal human rights, restorative justice, and religious freedom.",
    "commonThemes": "Critiques of the military-industrial complex, healthcare as a human right, and legal analysis of social justice.",
    "audienceProfile": "Human rights activists, the Muslim-American community, and social justice organizers."
  },
  {
    "id": 86,
    "name": "Brian Beutler",
    "score": "42D",
    "strongestBeliefs": "Structural political reform and the belief that Democrats must \"play hardball\" to win.",
    "commonThemes": "Procedural hypocrisy in the GOP, legislative strategy, and media critiques.",
    "audienceProfile": "Political junkies, Capitol Hill staffers, and aggressive partisan strategists."
  },
  {
    "id": 87,
    "name": "Harry Litman",
    "score": "35D",
    "strongestBeliefs": "Institutional integrity of the DOJ and the importance of expert legal consensus.",
    "commonThemes": "Criminal trial analysis (specifically 14th Amendment and Jan 6th), Supreme Court previews, and DOJ procedure.",
    "audienceProfile": "Law students, former federal officials, and MSNBC/CNN legal viewers."
  },
  {
    "id": 88,
    "name": "Malcolm Nance",
    "score": "48D",
    "strongestBeliefs": "National security is threatened by internal \"treason\" and Russian interference.",
    "commonThemes": "Counter-terrorism, intelligence analysis of the MAGA movement, and his personal service in Ukraine.",
    "audienceProfile": "National security hawks (left-leaning), military veterans, and high-intensity anti-Trump voters."
  },
  {
    "id": 89,
    "name": "John Ganz",
    "score": "45D",
    "strongestBeliefs": "The rise of modern populism is rooted in the \"lost decade\" of the 1990s.",
    "commonThemes": "Historical analysis of fascism, cultural criticism, and the philosophy of the \"New Right.\"",
    "audienceProfile": "Historians, political theorists, and deep-dive intellectual readers."
  },
  {
    "id": 90,
    "name": "Katie Halper",
    "score": "50D",
    "strongestBeliefs": "Anti-establishmentarianism and skepticism of \"Mainstream\" Democratic Party narratives.",
    "commonThemes": "Critiquing corporate media, the Israel-Palestine conflict, and highlighting progressive movements ignored by the DNC.",
    "audienceProfile": "Independent-minded socialists, anti-war activists, and fans of Matt Taibbi."
  },
  {
    "id": 91,
    "name": "David Nir",
    "score": "44D",
    "strongestBeliefs": "The path to political power starts with local and state-level \"down-ballot\" races.",
    "commonThemes": "Election data, redistricting (gerrymandering), and the \"netroots\" movement.",
    "audienceProfile": "Campaign data nerds, local organizers, and Daily Kos veterans."
  },
  {
    "id": 92,
    "name": "Charlotte Clymer",
    "score": "47D",
    "strongestBeliefs": "Transgender rights are at the center of the modern civil rights struggle.",
    "commonThemes": "LGBTQ+ advocacy, veteran issues, and the intersection of faith and progressive politics.",
    "audienceProfile": "Trans rights activists, military veterans (liberal), and high-visibility digital activists."
  },
  {
    "id": 93,
    "name": "David Lat",
    "score": "10R",
    "strongestBeliefs": "The legal system should be elite, transparent, and strictly procedural.",
    "commonThemes": "Judicial nominations, the culture of big law firms, and appellate court drama.",
    "audienceProfile": "Big Law partners, federal judges, and conservative legal scholars."
  },
  {
    "id": 94,
    "name": "Anas Alhajji",
    "score": "15R",
    "strongestBeliefs": "Market forces and fossil fuels will remain the backbone of the global economy for decades.",
    "commonThemes": "Oil market data, the \"green energy\" transition vs. reality, and OPEC+ strategy.",
    "audienceProfile": "Energy investors, hedge fund managers, and geopolitical realists."
  },
  {
    "id": 95,
    "name": "Zaid Jilani",
    "score": "5D",
    "strongestBeliefs": "Class-based populism over identity politics.",
    "commonThemes": "Critiquing \"woke\" culture from the left, economic inequality, and bipartisan populist movements.",
    "audienceProfile": "\"Anti-woke\" liberals, class-first progressives, and policy centrists."
  },
  {
    "id": 96,
    "name": "Danielle DiMartino Booth",
    "score": "25R",
    "strongestBeliefs": "The Federal Reserve has too much power and has distorted the natural market cycle.",
    "commonThemes": "Inflation warnings, Fed critiques, and the looming \"debt crisis.\"",
    "audienceProfile": "\"Doomsday\" investors, financial advisors, and monetary policy skeptics."
  },
  {
    "id": 97,
    "name": "Bill Maher",
    "score": "10D",
    "strongestBeliefs": "Free speech absolutism, secularism/rationalism (vehemently anti-religion), and \"common sense\" environmentalism. He is a fierce critic of what he calls \"performative\" or \"woke\" politics.",
    "commonThemes": "Critiquing \"woke\" culture, the \"cancel culture\" industrial complex, the benefits of capitalism over socialism, and the legalization of marijuana. He often warns Democrats that they are \"losing the plot\" by focusing on identity politics instead of middle-class kitchen table issues.",
    "audienceProfile": "\"Old school\" liberals, Gen-X centrists, \"9/11 Liberals,\" and surprisingly, a growing segment of the right-wing who enjoy seeing him \"roast\" his own side."
  },
  {
    "id": 98,
    "name": "Harry Sisson",
    "score": "48D",
    "strongestBeliefs": "Youth engagement is the only way to save American democracy. He believes in the total disqualification of the modern Republican party and is a staunch defender of Democratic leadership (Biden, Harris, and now the 2026-era candidates).",
    "commonThemes": "Debunking \"MAGA\" misinformation, healthcare as a human right, climate legislation, and student loan forgiveness. He frequently engages in high-intensity \"ragebait\" or trolling of right-wing figures like Charlie Kirk and Donald Trump.",
    "audienceProfile": "Gen-Z progressives, TikTok-first voters, and the \"online center-left.\" He is often criticized by the right as a \"paid shill\" (due to consulting fees from liberal PACs like Democracy Defense Action) and by some on the far-left for being too \"establishment.\""
  }
]
